app/Http/Controllers/QuestionController.php

    public function index ()
    {
        $questions = Question::with( 'user' )->latest()->paginate( 5 );
---
select * from `questions` order by `created_at` desc limit 5 offset 5
select * from `users` where `users`.`id` in (6, 7, 8)
select count(*) as aggregate from `questions`

    public function show ( Question $question )
    {
        $question->increment( 'views' );
---
update `questions` set `views` = `views` + 1, `questions`.`updated_at` = '2020-05-06 14:54:32' where `id` = 30