app/Providers/RouteServiceProvider.php

select * from `answers` where `answers`.`question_id` in (30)
select * from `users` where `users`.`id` in (2, 4)
select * from `questions` where `slug` = 'natus-aut-nisi-quaerat-voluptas-distinctio-nobis-sed-eaque-quas' limit 1
---
    public function boot ()
    {
        parent::boot();
        Route::bind( 'slug', function ( $slug ) {
//            return Question::with( [ 'answers.user', 'answers' => function ( $query ) {
//                $query->orderBy( 'votes_count', 'DESC' );
//            } ] )->where( 'slug', $slug )->firstOrFail();
            return Question::with( [ 'user', 'answers.user' ] )->where( 'slug', $slug )->firstOrFail();
        } );